Documents/ПродажаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПродажаТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РегистрНакопления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрНакопления</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПродажаТовара/Forms/ФормаСрокГодности/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрНакопленияОстатки.СрокГодности КАК СрокГодности,
		|	РегистрНакопленияОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	РегистрНакопленияОстатки.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.РегистрНакопления.Остатки(&Дата, Номенклатура = &Номенклатура) КАК РегистрНакопленияОстатки";
	
	Запрос.УстановитьПараметр("Дата", Параметры.Дата);
	Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаСрокиГодности.Очистить();
	Для каждого Стр Из РезультатЗапроса Цикл
	   НоваяСтрока = ТаблицаСрокиГодности.Добавить();
	   НоваяСтрока.СрокГодности = Стр.СрокГодности;
	   НоваяСтрока.Остаток = Стр.КоличествоОстаток;
 	КонецЦикла;
КонецПроцедуры



&НаКлиенте
Процедура Выбрать(Команда)

    ТекСтрока = Элементы.ТаблицаСрокиГодности.ТекущиеДанные;

    Если ТекСтрока = Неопределено Тогда
        Предупреждение("Выберите срок годности");
        Возврат;
	КонецЕсли;

	Результат = Новый Структура;
    Результат.Вставить("СрокГодности", ТекСтрока.СрокГодности);
    
  	Закрыть(Результат);

КонецПроцедуры
